using System;

// Статичний клас в C #, висловлює ідею патерну проектування - Singleton.

// Правила:
// 1. Примірник статичного класу можна створити.
// 2. Static class завжди успадковується від Оbject (Спроба успадкування від чого або іншого призводить до помилки компіляції).
// 3. Static class не реалізує інтерфейси. Спроба успадкування від інтерфейсу призводить до помилки рівня компіляції.
// 4. Містить тільки статичні члени (наявність в ньому нестатичних члена призведе до помилки компіляції).
// 5. Статичний клас не може містити конструкторів примірників.
// 6. Статичний клас закритий для наслідування від нього. Спроба успадкування від статичного класу призводить до помилки рівня компіляції.

namespace Static
{
    static class StaticClass //: object // Наслідування тільки від Object (явно або неявно)
    {
        // Контруктор екземпляра - недопустимий.
        // public StaticClass ()
        // {
        // Console.WriteLine ( "Constructor.");
        //}

        // Статичний конструктор.
        static StaticClass()
        {
            Console.WriteLine("Static Constructor");
        }

        // Статичний метод.
        public static void StaticMethod()
        {
            Console.WriteLine("StaticMethod");
        }

        // Нестатичний метод - недопустимий.
        // public void NotStaticMethod ()
        // {
        // Console.WriteLine ( "NotStaticMethod");
        //}
    }
}
